shadaazubair-pixel/embdsystms/STM32 programming/F401drivers/DriversDev/Src/button_led.c
#include "stm32f401xx.h"
#include "stm32f401xx_gpio_driver.h"



void delay1(void){
	for(uint32_t i=0; i<10000; i++){
		for(uint32_t j=1; j<=250;j++);
	}
}

int main(void){

	GPIO_Handle_t GpioLed, GpioButton, GpioextLED1, GpioextLED2;

//on board LED configuraion
	GpioLed.pGPIOx = GPIOA;
	GpioLed.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_5;
	GpioLed.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
	GpioLed.GPIO_PinConfig.GPIO_PinSpeed= GPIO_SPEED_HIGH ;
	GpioLed.GPIO_PinConfig.GPIO_PinOPType= OUTPUT_PUSHPULL;
	GpioLed.GPIO_PinConfig.GPIO_PinPupdControl = GPIO_NOPULLUP_NOPULLDOWN;


	//button configuration
	GpioButton.pGPIOx = GPIOC;
	GpioButton.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_13;
	GpioButton.GPIO_PinConfig.GPIO_PinMode= GPIO_MODE_IN;
	GpioButton.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_HIGH;




	//External LED1 configuraion
	GpioextLED1.pGPIOx = GPIOA;
	GpioextLED1.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_6;
	GpioextLED1.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
	GpioextLED1.GPIO_PinConfig.GPIO_PinSpeed= GPIO_SPEED_HIGH ;
	GpioextLED1.GPIO_PinConfig.GPIO_PinOPType= OUTPUT_PUSHPULL;
	GpioextLED1.GPIO_PinConfig.GPIO_PinPupdControl = GPIO_NOPULLUP_NOPULLDOWN;

		//External LED2 configuraion
	GpioextLED2.pGPIOx = GPIOA;
	GpioextLED2.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_7;
	GpioextLED2.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
	GpioextLED2.GPIO_PinConfig.GPIO_PinSpeed= GPIO_SPEED_HIGH ;
	GpioextLED2.GPIO_PinConfig.GPIO_PinOPType= OUTPUT_PUSHPULL;
	GpioextLED2.GPIO_PinConfig.GPIO_PinPupdControl = GPIO_NOPULLUP_NOPULLDOWN;

// enable clock
	GPIO_PeriClockControl(GPIOA,ENABLE);
	GPIO_PeriClockControl(GPIOC,ENABLE);


	//GPIO initializing
	GPIO_Init(&GpioLed);
	GPIO_Init(&GpioButton);
	GPIO_Init(&GpioextLED1);
	GPIO_Init(&GpioextLED2);









	while(1)
	{

		//task 1
		uint8_t a=GPIO_Readfrominputpin(GPIOC, GPIO_PIN_NO_13);
		if(a==0){ //if button pressed
			GPIO_Toggleoutputpin(GPIOA, GPIO_PIN_NO_5); //LED toggle

		}

		// task 2
		GPIO_Writetooutputpin(GPIOA,GPIO_PIN_NO_6,1); //LED1 ON
		GPIO_Writetooutputpin(GPIOA,GPIO_PIN_NO_7,0); //LED2 OFF

		delay1();


		GPIO_Writetooutputpin(GPIOA,GPIO_PIN_NO_6,0); //LED 1 OFF
		GPIO_Writetooutputpin(GPIOA,GPIO_PIN_NO_7,1);  //LED 2 ON
	    delay1();






	}

}




